In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data=pd.read_csv('../dataset/Social_Network_Ads.csv')

In [3]:
data.sample(5)

      User ID  Gender  Age  EstimatedSalary  Purchased
178  15584114    Male   24            23000          0
388  15672330    Male   47            34000          1
216  15636023    Male   49            65000          0
67   15654574  Female   23            82000          0
50   15694395  Female   24            32000          0

In [4]:
data.shape

(400, 5)

In [5]:
data.drop(['User ID'],axis=1,inplace=True)

In [6]:
data.sample(5)

     Gender  Age  EstimatedSalary  Purchased
250  Female   44            39000          0
95   Female   35            44000          0
243  Female   56           104000          1
261    Male   36           144000          1
15     Male   29            80000          0

In [7]:
data.describe()

              Age  EstimatedSalary   Purchased
count  400.000000       400.000000  400.000000
mean    37.655000     69742.500000    0.357500
std     10.482877     34096.960282    0.479864
min     18.000000     15000.000000    0.000000
25%     29.750000     43000.000000    0.000000
50%     37.000000     70000.000000    0.000000
75%     46.000000     88000.000000    1.000000
max     60.000000    150000.000000    1.000000

In [8]:
data['EstimatedSalary']= data['EstimatedSalary']/1000

In [9]:
data.sample (5)

     Gender  Age  EstimatedSalary  Purchased
399  Female   49             36.0          1
150  Female   26             15.0          0
297  Female   43            112.0          1
293    Male   37             77.0          0
318    Male   45             32.0          1